// 1) Создать HTML страницу и подключить к ней файл скрипта

// 2) В файле скрипта создать 2 переменные (money и time), которые будут получать данные от пользователя:

// ·      Первая будет спрашивать "Ваш бюджет на месяц?"

// ·      Вторая "Введите дату в формате YYYY-MM-DD"

let money = +prompt("Ваш бюджет на месяц?");
let time = prompt("Введите дату в формате YYYY-MM-DD");

console.log("money: ", money);
console.log("time: ", time);

// 3) Создать объект appData, который будет содержать такие данные:

// ·      бюджет (передаем сюда переменную из п.2)

// ·      данные времени - timeData (передаем сюда переменную из п.2)

// ·      объект с обязательными расходами - expenses (смотри пункт 4)
//        Hint: объект создается лишь пустыми скобками: expenses : {}

// ·      объект с необязательными расходами - optionalExpenses (оставляем пока пустым)

// ·      массив данных с доп. доходом - income (оставляем пока пустым)
//        Hint: массив создается лишь пустыми квадратными скобками: income : []

// ·      свойство savings (выставляем его как false)

var appData = {
  budget: money,
  timeData: time,
  expenses: {},
  optionalExpenses: {},
  income: [],
  savings: false
};

console.log("appData: ", appData);

// 4) Задать пользователю по 2 раза вопросы:

//     “Введите обязательную статью расходов в этом месяце”

//     “Во сколько обойдется?”

//     Записать ответы в объект expenses в формате: 

//     expenses: {
//     “ответ на первый вопрос” : “ответ на второй вопрос”
//     }

for (let i = 0; i < 2; i++) {
  let a = prompt("Введите обязательную статью расходов в этом месяце?");
  let b = prompt("Во сколько обойдется?");
// Потому, что при отмене promt возвращает null
  if (typeof(a) === 'string' && typeof(a) != null && typeof(a) != null && a != '' && b != '' &&  a.length < 50) {
    console.log("done");
    appData.expenses[a] = b;
  } else {
    console.log("плохо");
    i--;
  }
};

// цикл while
let k = 0;
while (k < 2) {
  let a = prompt("Введите обязательную статью расходов в этом месяце?");
  let b = prompt("Во сколько обойдется?");

  if (typeof(a) === 'string' && typeof(a) != null && typeof(a) != null && a != '' && b != '' &&  a.length < 50) {
    console.log("done");
    appData.expenses[a] = b;
  } else {
    console.log("плохо");
    k--;
  }

  k++;
}

//цикл do while
let t = 0;

do {
  let a = prompt("Введите обязательную статью расходов в этом месяце?");
  let b = prompt("Во сколько обойдется?");

  if (typeof(a) === 'string' && typeof(a) != null && typeof(a) != null && a != '' && b != '' &&  a.length < 50) {
    console.log("done");
    appData.expenses[a] = b;
  } else {
    console.log("плохо");
    t--;
  }

  t++;
}
while (t < 2);


appData.moneyPerDay = appData.budget/30;

// 5) Вывести на экран пользователя бюджет на 1 день (брать месяц за 30 дней, использовать alert)
alert("Ежедневный бюджет: " + appData.moneyPerDay + "грн");

if (appData.moneyPerDay < 100) {
  console.log("Минимальынй уровень достатка");
} else if (appData.moneyPerDay > 100 && appData.moneyPerDay < 2000) {
    console.log("Средний уровень достатка");
} else if (appData.moneyPerDay > 2000) {
    console.log("Высокий уровень достатка");
} else {
    console.log("Ошибка");
}

// 6) Проверить, чтобы все работало без ошибок в консоли

// 7) Создать свой репозиторий на GitHub и поместить туда папку с первым заданием

// Вопросы к этому заданию
// Сколько типов данных существует в JS?
// 2. Простые и объектные, а простые уже разделяются на числа, строки, булевы, Symbol, null, undefined. А объектные на массивы, коллекции, 
// самый обычный объект, ошибки, регулярные выражения. 
// Null по спецификации считается отдельным типо данным, но typeof выдаст, что это это объектв.

// Как вывести информацию в консоль?
// с помощью команды console.log();

console.log(typeof null);
console.log(typeof NaN);

// Какая функция операторов || и &&?
// Логическое 'или' || и логическое 'и' &&. Бинарные операторы, один возвращает true, когда верно хоть одно утверждение, потом и 'или', а второй
// возвращает true только когда верны оба утверждения.